In [23]:
import pandas as pd
import sqlite3

In [24]:
conn = sqlite3.connect("./sqlite_db_pythonsqlite.db")

In [25]:
df1 = pd.read_sql_query("SELECT facility,SUM(COST)AS revenue FROM(SELECT F.name AS facility,CASE WHEN B.memid=0 THEN B.slots*F.guestcost ELSE B.slots*F.membercost END AS COST FROM Bookings AS B LEFT JOIN Facilities AS F ON B.facid=F.facid)AS temp GROUP BY facility HAVING revenue<1000 ORDER BY revenue;", conn);

In [26]:
df1.head(5)

        facility  revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [27]:
df2 = pd.read_sql_query("SELECT A.surname||' '||A.firstname AS member,B.firstname AS recommended_by FROM Members AS A LEFT JOIN Members AS B ON A.recommendedby=B.memid ORDER BY member ASC;", conn)

In [28]:
df2.head()

           member recommended_by
0  Bader Florence         Ponder
1      Baker Anne         Ponder
2   Baker Timothy         Jemima
3      Boothe Tim            Tim
4  Butters Gerald         Darren

In [29]:
df3 = pd.read_sql_query("SELECT facid, memid, COUNT(*) AS bookings FROM Bookings WHERE memid != 0 GROUP BY facid, memid;", conn)

In [30]:
df3.head()

   facid  memid  bookings
0      0      2        30
1      0      3         6
2      0      4        19
3      0      5        57
4      0      6        31

In [31]:
df4 = pd.read_sql_query("SELECT facid, strftime('%m-%Y', starttime) AS month, COUNT(*) AS bookings FROM Bookings WHERE memid != 0 GROUP BY facid, month", conn)

In [32]:
df4.head()

   facid    month  bookings
0      0  07-2012        65
1      0  08-2012       111
2      0  09-2012       132
3      1  07-2012        41
4      1  08-2012       109

In [33]:
conn.close()